In [1]:
import pandas as pd
import numpy as np

In [2]:
dummy_df = pd.read_csv('dummy_data.csv')

In [3]:
dummy_df

   Sno     Name   Age  Height(cm)
0    1     John  25.0       160.0
1    2    Jimmy  26.0       163.0
2    3  Felicia  28.0       154.0
3    4   Sophia   NaN       143.0
4    5      Bob   NaN         NaN
5    6    Billy  30.0       156.0
6    7     Kate  31.0       160.0
7    8     Will  29.0         NaN
8    9    Scott   NaN       148.0

# Reasons for missing Data  
1. User did not want to fill data due to privacy issues  
2. Loss of data while transferring  
3. Insufficient information to fill a particular column, etc.  

There can be multiple reasons for missing values in a dataset

## df.describe()

In [4]:
dummy_df.describe()

            Sno        Age  Height(cm)
count  9.000000   6.000000    7.000000
mean   5.000000  28.166667  154.857143
std    2.738613   2.316607    7.174691
min    1.000000  25.000000  143.000000
25%    3.000000  26.500000  151.000000
50%    5.000000  28.500000  156.000000
75%    7.000000  29.750000  160.000000
max    9.000000  31.000000  163.000000

Here `count` returns Non-null values

In [5]:
len(dummy_df)

9

## Since NaN is considered float, the data is converted to float type

In [ ]:
string_dummy_df = pd.read_csv('dummy_str_data.csv',index_col=0)

## df.isna() and df.notna()

In [6]:
dummy_df.isna()

     Sno   Name    Age  Height(cm)
0  False  False  False       False
1  False  False  False       False
2  False  False  False       False
3  False  False   True       False
4  False  False   True        True
5  False  False  False       False
6  False  False  False       False
7  False  False  False        True
8  False  False   True       False

In [7]:
dummy_df.notna()

    Sno  Name    Age  Height(cm)
0  True  True   True        True
1  True  True   True        True
2  True  True   True        True
3  True  True  False        True
4  True  True  False       False
5  True  True   True        True
6  True  True   True        True
7  True  True   True       False
8  True  True  False        True

## df.isnull()

In [ ]:
dummy_df.isnull()

## Finding count of missing values in each column

In [9]:
dummy_df.isnull().sum()

Sno           0
Name          0
Age           3
Height(cm)    2
dtype: int64

In [10]:
string_dummy_df = pd.read_csv('dummy_str_data.csv', index_col=0)

In [11]:
string_dummy_df

         Device_name             Device_description Single-Use
Sno
1           Synringe        Used to inject medicine       True
2         Ventilator   Used to help patients breath      False
3    Surgical Gloves                            NaN       True
4       Stethescopes                            NaN        NaN
5    Vials container                            NaN        NaN

### Sometimes information for a column is insufficient to assign a value

# Missing data for datetime

In [14]:
time_df = pd.read_csv('dummy_time.csv', index_col=0)

In [15]:
time_df

   Sno     Name   Age  Height(cm)    birthday
0    1     John  25.0       160.0  1994-01-01
1    2    Jimmy  26.0       163.0         NaN
2    3  Felicia  28.0       154.0  1995-01-01
3    4   Sophia   NaN       143.0         NaN
4    5      Bob   NaN         NaN  1994-01-01
5    6    Billy  30.0       156.0  1994-01-01
6    7     Kate  31.0       160.0  1990-01-01
7    8     Will  29.0         NaN  1991-07-01
8    9    Scott   NaN       148.0         NaN

In [18]:
type(time_df['birthday'][0])

str

In [19]:
time_df['birthday'] = pd.to_datetime(time_df['birthday'])

In [20]:
time_df

   Sno     Name   Age  Height(cm)   birthday
0    1     John  25.0       160.0 1994-01-01
1    2    Jimmy  26.0       163.0        NaT
2    3  Felicia  28.0       154.0 1995-01-01
3    4   Sophia   NaN       143.0        NaT
4    5      Bob   NaN         NaN 1994-01-01
5    6    Billy  30.0       156.0 1994-01-01
6    7     Kate  31.0       160.0 1990-01-01
7    8     Will  29.0         NaN 1991-07-01
8    9    Scott   NaN       148.0        NaT

### In datetime format, missing values are denoted by NaT

### NaN values are considered to be float by default in pandas